platformio/platform-siliconlabsefm32/misc/svd/EFR32BG22.svd
        <register>
          <name>ABUSALLOC</name>
          <description>A Bus allocation</description>
          <addressOffset>0x320</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>AEVEN0</name>
              <description>A Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGA</name>
                  <description>The bus is allocated to DIAGA</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEVEN1</name>
              <description>A Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AODD0</name>
              <description>A Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGA</name>
                  <description>The bus is allocated to DIAGA</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AODD1</name>
              <description>A Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BBUSALLOC</name>
          <description>B Bus allocation</description>
          <addressOffset>0x324</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>BEVEN0</name>
              <description>B Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEVEN1</name>
              <description>B Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD0</name>
              <description>B Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD1</name>
              <description>B Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CDBUSALLOC</name>
          <description>CD Bus allocation</description>
          <addressOffset>0x328</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CDEVEN0</name>
              <description>CD Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMON</name>
                  <description>The bus is allocated to Process Monitor</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFUSE</name>
                  <description>The bus is allocated for EFUSE programming voltage</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDEVEN1</name>
              <description>CD Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD0</name>
              <description>CD Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMON</name>
                  <description>The bus is allocated to Process Monitor</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD1</name>
              <description>CD Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AODD0SWITCH</name>
          <description>ABUS AODD0 Switch Register</description>
          <addressOffset>0x330</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>AODD0SWITCH</name>
              <description>AODD0 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AODD1SWITCH</name>
          <description>ABUS AODD1 Switch Register</description>
          <addressOffset>0x334</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>AODD1SWITCH</name>
              <description>AODD1 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AEVEN0SWITCH</name>
          <description>ABUS AEVEN0 Switch Register</description>
          <addressOffset>0x338</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>AEVEN0SWITCH</name>
              <description>AEVEN0 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AEVEN1SWITCH</name>
          <description>ABUS AEVEN1 Switch Register</description>
          <addressOffset>0x33C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>AEVEN1SWITCH</name>
              <description>AEVEN1 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODD0SWITCH</name>
          <description>ABUS BODD0 Switch Register</description>
          <addressOffset>0x340</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>BODD0SWITCH</name>
              <description>BODD0 Switch Reg</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODD1SWITCH</name>
          <description>ABUS BODD1 Switch Register</description>
          <addressOffset>0x344</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>BODD1SWITCH</name>
              <description>BODD1 Switch Reg</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BEVEN0SWITCH</name>
          <description>ABUS BEVEN0 Switch Register</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>BEVEN0SWITCH</name>
              <description>BEVEN0 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BEVEN1SWITCH</name>
          <description>ABUS BEVEN1 Switch Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>BEVEN1SWITCH</name>
              <description>BEVEN1 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDODD0SWITCH</name>
          <description>ABUS CDODD0 Switch Register</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003000F</resetMask>
          <fields>
            <field>
              <name>CODD0SWITCH</name>
              <description>CODD0 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DODD0SWITCH</name>
              <description>DODD0 switch register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDODD1SWITCH</name>
          <description>ABUS CDODD1 Switch Register</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003000F</resetMask>
          <fields>
            <field>
              <name>CODD1SWITCH</name>
              <description>CODD1 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DODD1SWITCH</name>
              <description>DODD1 switch register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDEVEN0SWITCH</name>
          <description>ABUS CDEVEN0 Switch Register</description>
          <addressOffset>0x358</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003000F</resetMask>
          <fields>
            <field>
              <name>CEVEN0SWITCH</name>
              <description>CEVEN0 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVEN0SWITCH</name>
              <description>DEVEN0 switch register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDEVEN1SWITCH</name>
          <description>ABUS CDEVEN1 Switch Register</description>
          <addressOffset>0x35C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003000F</resetMask>
          <fields>
            <field>
              <name>CEVEN1SWITCH</name>
              <description>CEVEN1 switch register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVEN1SWITCH</name>
              <description>DODD1 switch register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
